References/ASTT/TestSuits/Tests/DeviceDiscovery/TC.DD.NVT.03/TC.DD.NVT.03_REQ_01.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof">
  <soap:Header>
    <wsa:To>
      urn:schemas-xmlsoap-org:ws:2005:04:discovery
    </wsa:To>
    <wsa:Action>
      http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello
    </wsa:Action>
    <wsa:MessageID>
      urn:uuid:0f5d604c-81ac-4abc-8010-51dbffad55f2
    </wsa:MessageID>
    <wsd:AppSequence InstanceId="2"
        SequenceId="urn:uuid:369a7d7b-5f87-48a4-aa9a-189edf2a8772"
        MessageNumber="14"/>
  </soap:Header>
  <soap:Body>
    <wsd:Hello>
      <wsa:EndpointReference>
        <wsa:Address>
          urn:uuid:37f86d35-e6ac-4241-964f-1d9ae46fb366
        </wsa:Address>
      </wsa:EndpointReference>
      <wsd:Types>wsdp:Device</wsd:Types>
      <wsd:MetadataVersion>2</wsd:MetadataVersion>
    </wsd:Hello>
  </soap:Body>
</soap:Envelope>